src/test/resources/integrationtest/prediktion/getPrediktion_Model2Request_output_0.77.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:clinicalprocess:healthcond:srs:GetSRSInformationResponder:2" xmlns:urn1="urn:riv:clinicalprocess:healthcond:certificate:types:2">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:GetSRSInformationRequest>
         <urn:version>1</urn:version>
         <urn:konsument-id>
            <urn1:root>1.2.752.129.2.1.4.1</urn1:root>
            <urn1:extension>123456</urn1:extension>
         </urn:konsument-id>
         <urn:anvandare-id>
            <urn1:root>1.2.752.129.2.1.4.1</urn1:root>
            <urn1:extension>98765</urn1:extension>
         </urn:anvandare-id>
         <!--Optional:-->
         <urn:prediktionsfaktorer>
            <urn:postnummer>80000</urn:postnummer>
            <!--1 or more repetitions:-->
            <urn:fragasvar>
               <urn:frageid-srs>SA_1_gross</urn:frageid-srs>
               <urn:svarsid-srs>(180,366]</urn:svarsid-srs>
            </urn:fragasvar>
            <urn:fragasvar>
               <urn:frageid-srs>NoCareAtStart</urn:frageid-srs>
               <urn:svarsid-srs>CareAtStart</urn:svarsid-srs>
            </urn:fragasvar>
            <urn:fragasvar>
               <urn:frageid-srs>Visits_yearBefore_all_r1_median</urn:frageid-srs>
               <urn:svarsid-srs>aboveMedian</urn:svarsid-srs>
            </urn:fragasvar>
            <urn:fragasvar>
               <urn:frageid-srs>SA_SyssStart_fct</urn:frageid-srs>
               <urn:svarsid-srs>unemp</urn:svarsid-srs>
            </urn:fragasvar>
            <urn:fragasvar>
               <urn:frageid-srs>Vtid_yearBefore_all_r1_median</urn:frageid-srs>
               <urn:svarsid-srs>aboveMedian</urn:svarsid-srs>
            </urn:fragasvar>
            <urn:fragasvar>
               <urn:frageid-srs>edu_cat_fct</urn:frageid-srs>
               <urn:svarsid-srs>No university</urn:svarsid-srs>
            </urn:fragasvar>
         </urn:prediktionsfaktorer>
         <urn:individer>
            <urn:individ>
               <urn:person-id>195801080214</urn:person-id>
               <urn:diagnos>
                  <urn1:code>diagnos_placeholder</urn1:code>
                  <urn1:codeSystem>1.2.752.116.1.1.1.1.3</urn1:codeSystem>
               </urn:diagnos>
               <urn:intyg-id>
                  <urn1:root>root</urn1:root>
                  <urn1:extension>intygsid_placeholder</urn1:extension>
               </urn:intyg-id>
            </urn:individ>
         </urn:individer>
         <urn:utdatafilter>
            <urn:prediktion>true</urn:prediktion>
            <urn:atgardsrekommendation>false</urn:atgardsrekommendation>
            <urn:statistik>false</urn:statistik>
         </urn:utdatafilter>
      </urn:GetSRSInformationRequest>
   </soapenv:Body>
</soapenv:Envelope>